# settings/config.py

# --- Настройки окна tkinter ---
WINDOW_WIDTH = 1200  # Ширина окна приложения в пикселях
WINDOW_HEIGHT = 1000 # Высота окна приложения в пикселях
WINDOW_TITLE = "Игра 'Суперпятнашки'" # Заголовок окна приложения

# --- Настройки окна pygame ---


# Цвета (если не определены)
WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
BACKGROUND_COLOR = (240, 240, 240)
TILE_COLOR = (150, 150, 255)  # Цвет плитки (светло-голубой)
HIGHLIGHT_COLOR = (255, 200, 0) # Цвет для подсветки

# Отступы и поля
MARGIN = 10 # Отступ от краев окна
TILE_BORDER = 2 # Ширина рамки вокруг плитки